# Funding awarded for coal tip remediation in Wales
Simple web scraper to scrape an HTML table and turn it into a DataFrame

## Import dependencies

In [17]:
import requests 
from bs4 import BeautifulSoup as bs
import pandas as pd

## Load page

In [14]:
url = "https://www.gov.wales/record-funding-safety-works-more-130-coal-tip-sites-across-wales"
r = requests.get(url)
soup = bs(r.content, "html.parser")
print(soup.title.text)

Record funding for safety works at more than 130 coal tip sites across Wales | GOV.WALES

## Find table

In [21]:
table = soup.find("tbody")

In [74]:
columns = table.find("tr").find_all("td") #extracting first row (headings)
columns_list = [x.string for x in columns]
columns_list

table_rows = table.find_all("tr")[1:] #skipping table head
l =[]
for tr in table_rows:
    tds = tr.find_all("td") 
    row = [td.string.strip() for td in tds] #extracting text
    l.append(row)
l

[['Blaenau Gwent', '£1,997,100.00'],
 ['Bridgend', '£1,835,000.00'],
 ['Caerphilly', '£2,780,445.16'],
 ['Cardiff', '£110,000.00'],
 ['Merthyr', '£4,279,287.00'],
 ['Monmouth', '£16,157.00'],
 ['Neath Port Talbot', '£6,345,000.00'],
 ['NRW', '£2,298,739.00'],
 ['Rhondda Cynon Taf', '£11,493,605.00'],
 ['Torfaen', '£1,982,521.00'],
 ['Wrexham', '£823,928.93'],
 ['TOTAL', '£33,961,783.09']]

## Data Frame & Data Cleaning
Processing "Total Award" column to turn into float

In [83]:
df = pd.DataFrame(l, columns= columns_list)
df["Total Award"] = df["Total Award"].replace({'£': '', ',':''}, regex=True).astype(float)
df.sort_values("Total Award")
df

            Applicant  Total Award
0       Blaenau Gwent   1997100.00
1            Bridgend   1835000.00
2          Caerphilly   2780445.16
3             Cardiff    110000.00
4             Merthyr   4279287.00
5            Monmouth     16157.00
6   Neath Port Talbot   6345000.00
7                 NRW   2298739.00
8   Rhondda Cynon Taf  11493605.00
9             Torfaen   1982521.00
10            Wrexham    823928.93
11              TOTAL  33961783.09